### Pandas - DataFrame
- 2차원 행렬(표), Series를 묶어낸 자료형

In [2]:
import numpy as np
import pandas as pd

In [3]:
n= "\n-----------------------------------------------------------------------------\n"

---
##### DataFrame 생성

In [26]:
# 3. 2차원 ndarray 활용
arr = np.random.randn(2, 5)
print(arr, n)
df = pd.DataFrame(arr)
print(df, n)
print(df.columns, n)
print(df.values, n)
print(type(df.values), n)
print("df.values.shape :", df.values.shape, n)
df = pd.DataFrame(arr, index=['ㄱ','ㄴ'], columns=['가','나','다','라','마'])
print(df, n)
print(df.index, n)
df.columns = ['A', 'B', 'C', 'D', 'E']
df.index = ['a', 'b']
print(df, n)
print(df.index, n)

[[ 0.07569998  1.08737817  1.68894689  1.10363164  0.4917402 ]
 [-0.24008279  0.34696157  0.4279221  -1.69533205 -1.36421004]]
-----------------------------------------------------------------------------

          0         1         2         3        4
0  0.075700  1.087378  1.688947  1.103632  0.49174
1 -0.240083  0.346962  0.427922 -1.695332 -1.36421
-----------------------------------------------------------------------------

RangeIndex(start=0, stop=5, step=1)
-----------------------------------------------------------------------------

[[ 0.07569998  1.08737817  1.68894689  1.10363164  0.4917402 ]
 [-0.24008279  0.34696157  0.4279221  -1.69533205 -1.36421004]]
-----------------------------------------------------------------------------

<class 'numpy.ndarray'>
-----------------------------------------------------------------------------

df.values.shape : (2, 5)
-----------------------------------------------------------------------------

          가         나         다         라        마
ㄱ  0.075700  1.087378  1.688947  1.103632  0.49174
ㄴ -0.240083  0.346962  0.427922 -1.695332 -1.36421
-----------------------------------------------------------------------------

Index(['ㄱ', 'ㄴ'], dtype='object')
-----------------------------------------------------------------------------

          A         B         C         D        E
a  0.075700  1.087378  1.688947  1.103632  0.49174
b -0.240083  0.346962  0.427922 -1.695332 -1.36421
-----------------------------------------------------------------------------

Index(['a', 'b'], dtype='object')
-----------------------------------------------------------------------------

In [45]:
# 1. dictionary-list 활용
data = {
    'one' : [1, 2, 3, 4, 5],
    'two' : ['가','나','다','라','마'],
    'three' : [1.23, 2.34, 3.45, 4.56, 5.67],
    'four' : True # True 는 Scalar로 저장되어 모든 행에 적용됨
}

df = pd.DataFrame(data)
print(df, n)
print(df['one'], n)
# 'four' 컬럼의 값이 [True]로 리스트에 1개만 들어가 있어서, 나머지 컬럼들과 길이가 맞지 않아 에러가 발생합니다.
# DataFrame을 생성할 때 각 컬럼의 데이터 길이가 동일해야 합니다.
# 만약 'four' 컬럼을 모든 행에 True로 채우고 싶다면, [True] 대신 True(스칼라 값)로 지정하면 됩니다.
# 예시:
# data = {
#     'one' : [1, 2, 3, 4, 5],
#     'two' : ['가','나','다','라','마'],
#     'three' : [1.23, 2.34, 3.45, 4.56, 5.67],
#     'four' : True # 이렇게 하면 모든 행에 True가 들어감
# }

   one two  three  four
0    1   가   1.23  True
1    2   나   2.34  True
2    3   다   3.45  True
3    4   라   4.56  True
4    5   마   5.67  True
-----------------------------------------------------------------------------

0    1
1    2
2    3
3    4
4    5
Name: one, dtype: int64
-----------------------------------------------------------------------------

In [52]:
# 2. list-dictionary 활용

data = [
    {'a' : 1, 'b' : 2, 'c' : 3},
    {'b' : 4, 'a' : 5, 'c' : 6},
    {'b' : 8, 'c' : 9} # a 키가 없는 경우 누락됨 NaN 처리, Not a Number
]
df = pd.DataFrame(data)
print(df, n)

print(df['a'], n)
print(df.a, n)
print(df.loc[:, ['a', 'c']], n)

df.index = ['토끼', '사자', '호랑이']
print(df.index, n)
df.columns = ['협동심', '친밀도', '존재감']
print(df)

     a  b  c
0  1.0  2  3
1  5.0  4  6
2  NaN  8  9
-----------------------------------------------------------------------------

0    1.0
1    5.0
2    NaN
Name: a, dtype: float64
-----------------------------------------------------------------------------

0    1.0
1    5.0
2    NaN
Name: a, dtype: float64
-----------------------------------------------------------------------------

     a  c
0  1.0  3
1  5.0  6
2  NaN  9
-----------------------------------------------------------------------------

Index(['토끼', '사자', '호랑이'], dtype='object')
-----------------------------------------------------------------------------

     협동심  친밀도  존재감
토끼   1.0    2    3
사자   5.0    4    6
호랑이  NaN    8    9

In [57]:
print(df,n)
print(df.loc['토끼'], n)

     협동심  친밀도  존재감
토끼   1.0    2    3
사자   5.0    4    6
호랑이  NaN    8    9
-----------------------------------------------------------------------------

협동심    1.0
친밀도    2.0
존재감    3.0
Name: 토끼, dtype: float64
-----------------------------------------------------------------------------

In [69]:
data = {
    '이름' : ['민정', '도연', '진형', '흥재'],
    '위치' : ['독산', '신림', '군포', '광명'],
    '성별' : ['F', 'F', 'M', 'M']
}
df = pd.DataFrame(data, index=[1, 2, 3, 4])
print(df, n, df.shape, n)
print(df.loc[1], n)
print(df.loc[1:2], n)
print(df.iloc[1:2], n)

   이름  위치 성별
1  민정  독산  F
2  도연  신림  F
3  진형  군포  M
4  흥재  광명  M
-----------------------------------------------------------------------------
 (4, 3)
-----------------------------------------------------------------------------

이름    민정
위치    독산
성별     F
Name: 1, dtype: object
-----------------------------------------------------------------------------

   이름  위치 성별
1  민정  독산  F
2  도연  신림  F
-----------------------------------------------------------------------------

   이름  위치 성별
2  도연  신림  F
-----------------------------------------------------------------------------

In [ ]:
# 전치행렬 (행과 열을 바꿈) -> .T 전치행렬도 속성으로 가지고 있다.
df = df.T
print(df, n)

     1   2   3   4
이름  민정  도연  진형  흥재
위치  독산  신림  군포  광명
성별   F   F   M   M
-----------------------------------------------------------------------------

##### DataFrame 속성

In [78]:
print(df.index, n)
print(df.columns, n)
print(df.values, n, type(df.values), n)
print(df.shape, n)
print(df.ndim, n)
print(df.size, n)
print(df.dtypes, n)

Index([1, 2, 3, 4], dtype='int64')
-----------------------------------------------------------------------------

Index(['이름', '위치', '성별'], dtype='object')
-----------------------------------------------------------------------------

[['민정' '독산' 'F']
 ['도연' '신림' 'F']
 ['진형' '군포' 'M']
 ['흥재' '광명' 'M']]
-----------------------------------------------------------------------------
 <class 'numpy.ndarray'>
-----------------------------------------------------------------------------

(4, 3)
-----------------------------------------------------------------------------

2
-----------------------------------------------------------------------------

12
-----------------------------------------------------------------------------

이름    object
위치    object
성별    object
dtype: object
-----------------------------------------------------------------------------

In [79]:
# 신림, 군포 출력하기
print(df.loc[2:3, '위치'], n)

2    신림
3    군포
Name: 위치, dtype: object
-----------------------------------------------------------------------------

---
##### DataFrame 메서드

In [83]:
bank_client_df = pd.DataFrame({
    'Client ID': [1, 2, 3, 4],
    'Client Name': ['Aly', 'Steve', 'Nicole', 'Morris'],
    'Net worth [$]': [35000, 3000, 100000, 2000],
    'Years with bank': [4, 7, 10, 15]
})

bank_client_df

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [87]:
print(bank_client_df.head(2), n)
print(bank_client_df.tail(2), n)

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
-----------------------------------------------------------------------------

   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10
3          4      Morris           2000               15
-----------------------------------------------------------------------------

In [88]:
print(bank_client_df.info(), n)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Client ID        4 non-null      int64
 1   Client Name      4 non-null      object
 2   Net worth [$]    4 non-null      int64
 3   Years with bank  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes
None
-----------------------------------------------------------------------------

In [89]:
print(bank_client_df.describe(), n)

       Client ID  Net worth [$]  Years with bank
count   4.000000       4.000000         4.000000
mean    2.500000   35000.000000         9.000000
std     1.290994   45963.753836         4.690416
min     1.000000    2000.000000         4.000000
25%     1.750000    2750.000000         6.250000
50%     2.500000   19000.000000         8.500000
75%     3.250000   51250.000000        11.250000
max     4.000000  100000.000000        15.000000
-----------------------------------------------------------------------------

In [90]:

print(bank_client_df.describe(include='all'), n)
print(bank_client_df.describe(include='object'), n)
print(bank_client_df.describe(include='number'), n)

        Client ID Client Name  Net worth [$]  Years with bank
count    4.000000           4       4.000000         4.000000
unique        NaN           4            NaN              NaN
top           NaN         Aly            NaN              NaN
freq          NaN           1            NaN              NaN
mean     2.500000         NaN   35000.000000         9.000000
std      1.290994         NaN   45963.753836         4.690416
min      1.000000         NaN    2000.000000         4.000000
25%      1.750000         NaN    2750.000000         6.250000
50%      2.500000         NaN   19000.000000         8.500000
75%      3.250000         NaN   51250.000000        11.250000
max      4.000000         NaN  100000.000000        15.000000
-----------------------------------------------------------------------------

       Client Name
count            4
unique           4
top            Aly
freq             1
-----------------------------------------------------------------------------

       Client ID  Net worth [$]  Years with bank
count   4.000000       4.000000         4.000000
mean    2.500000   35000.000000         9.000000
std     1.290994   45963.753836         4.690416
min     1.000000    2000.000000         4.000000
25%     1.750000    2750.000000         6.250000
50%     2.500000   19000.000000         8.500000
75%     3.250000   51250.000000        11.250000
max     4.000000  100000.000000        15.000000
-----------------------------------------------------------------------------

In [98]:
# indexing / slicing
# iloc 인덱스 - 행/열 순서로 조회
# loc 인덱스 - 행/열 이름으로 조회

print(bank_client_df, n)
print(bank_client_df.iloc[1], n, type(bank_client_df.iloc[1]))
print((bank_client_df.iloc[1].name), (bank_client_df.iloc[1].index), n)
print((bank_client_df.iloc[1].values),(bank_client_df.iloc[1]).shape ,n)

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15
-----------------------------------------------------------------------------

Client ID              2
Client Name        Steve
Net worth [$]       3000
Years with bank        7
Name: 1, dtype: object
-----------------------------------------------------------------------------
 <class 'pandas.core.series.Series'>
1 Index(['Client ID', 'Client Name', 'Net worth [$]', 'Years with bank'], dtype='object')
-----------------------------------------------------------------------------

[np.int64(2) 'Steve' np.int64(3000) np.int64(7)] (4,)
-----------------------------------------------------------------------------

In [101]:
print(bank_client_df.iloc[1:3], n, type(bank_client_df.iloc[1:3]), n)
print(bank_client_df.iloc[:, 1:3], n)
print(bank_client_df.iloc[1:3, 1:3], n)

   Client ID Client Name  Net worth [$]  Years with bank
1          2       Steve           3000                7
2          3      Nicole         100000               10
-----------------------------------------------------------------------------
 <class 'pandas.core.frame.DataFrame'>
-----------------------------------------------------------------------------

  Client Name  Net worth [$]
0         Aly          35000
1       Steve           3000
2      Nicole         100000
3      Morris           2000
-----------------------------------------------------------------------------

  Client Name  Net worth [$]
1       Steve           3000
2      Nicole         100000
-----------------------------------------------------------------------------

In [103]:
# fancy indexing

print(bank_client_df.iloc[[0, 2]], n, type(bank_client_df.iloc[[0, 2]]), n)

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
2          3      Nicole         100000               10
-----------------------------------------------------------------------------
 <class 'pandas.core.frame.DataFrame'>
-----------------------------------------------------------------------------

In [110]:
# fancy indexing을 통한 조회는 결과가 1개여도 DataFrame 타입으로 반환
# - Series를 반환한다는 것은 차원을 축소(제거)하는 것
# - DataFrame을 반환한다는 것은 차원을 유지하는 것것

print(bank_client_df, n)
print(bank_client_df.iloc[2], n) # 2행 조회
print(type(bank_client_df.iloc[2]), n) # 1차원 -> type : Series
print(bank_client_df.iloc[[2]], n) # 2행 조회
print(type(bank_client_df.iloc[[2]]), n) # [[]] 2차원 -> type : DataFrame
print((bank_client_df.iloc[[2]]).shape, n) # 2차원 -> shape : (1, 4)


print(bank_client_df.iloc[[2, 0]], n)
print(type(bank_client_df.iloc[[2, 0]]), n) # 2행, 0행 조회, 2행, 0행 조회 결과가 DataFrame 형태로 출력됨
print((bank_client_df.iloc[[2, 0]]).shape, n) # 2차원 -> shape : (2, 4)

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15
-----------------------------------------------------------------------------

Client ID               3
Client Name        Nicole
Net worth [$]      100000
Years with bank        10
Name: 2, dtype: object
-----------------------------------------------------------------------------

<class 'pandas.core.series.Series'>
-----------------------------------------------------------------------------

   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10
-----------------------------------------------------------------------------

<class 'pandas.core.frame.DataFrame'>
-----------------------------------------------------------------------------

(1, 4)
-----------------------------------------------------------------------------

   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10
0          1         Aly          35000                4
-----------------------------------------------------------------------------

<class 'pandas.core.frame.DataFrame'>
-----------------------------------------------------------------------------

(2, 4)
-----------------------------------------------------------------------------

In [111]:
# 2차원 indexing / slicing
bank_client_df.iloc[0, 1]

'Aly'

In [ ]:
bank_client_df.iloc[:2, 1], type(bank_client_df.iloc[:2, 1])
# 2차원 데이터 조회시 슬라이싱과 인덱싱을 혼용해서 사용할 수 있음 -> 차원 축소
# 인덱싱을 통해서 값을 꺼내오는 경우는 차원 축소 **중요**
# 슬라이싱을 통해서 값을 꺼내오는 경우는 차원 유지

(0      Aly
 1    Steve
 Name: Client Name, dtype: object,
 pandas.core.series.Series)

In [ ]:
bank_client_df.iloc[:2, 2:], type(bank_client_df.iloc[:2, 2:])
# 슬라이싱을 통해서 값을 꺼내오는 경우는 차원 유지 **중요**

(   Net worth [$]  Years with bank
 0          35000                4
 1           3000                7,
 pandas.core.frame.DataFrame)

In [124]:
bank_client_df.index = ['client1', 'client2', 'client3', 'client4']
print(bank_client_df, n) # ! 인덱스 변경 후 조회, loc 사용 시 인덱스 이름으로 조회

print(bank_client_df.loc, n)
print(bank_client_df.loc['client3'], n, type(bank_client_df.loc['client3']), n)
print(bank_client_df.loc['client1', 'Client Name'], n)

         Client ID Client Name  Net worth [$]  Years with bank
client1          1         Aly          35000                4
client2          2       Steve           3000                7
client3          3      Nicole         100000               10
client4          4      Morris           2000               15
-----------------------------------------------------------------------------

<pandas.core.indexing._LocIndexer object at 0x000001F33708FAC0>
-----------------------------------------------------------------------------

Client ID               3
Client Name        Nicole
Net worth [$]      100000
Years with bank        10
Name: client3, dtype: object
-----------------------------------------------------------------------------
 <class 'pandas.core.series.Series'>
-----------------------------------------------------------------------------

Aly
-----------------------------------------------------------------------------

In [126]:
bank_client_df.loc['client2':'client4']

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
client3          3      Nicole         100000               10
client4          4      Morris           2000               15

In [128]:
bank_client_df.loc['client2':'client4':2]
# offset 조회

# iloc 인덱싱과 loc 인덱싱의 차이점 [a:b:c]
# 범위의 차이점
# iloc 인덱싱은 범위 조회 시 끝 값을 포함하지 않음
# loc 인덱싱은 범위 조회 시 끝 값을 포함함

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7
client4          4      Morris           2000               15

In [ ]:
bank_client_df.loc['client2':'client4':2, 'Client Name'], n, type(bank_client_df.loc['client2':'client4':2, 'Client Name'])

(client2     Steve
 client4    Morris
 Name: Client Name, dtype: object,
 '\n-----------------------------------------------------------------------------\n',
 pandas.core.series.Series)

In [136]:
print(bank_client_df.loc['client2':'client4', 'Client Name':'Net worth [$]'])
print(type(bank_client_df.loc['client2':'client4', 'Client Name':'Net worth [$]']))

        Client Name  Net worth [$]
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000
<class 'pandas.core.frame.DataFrame'>

In [137]:
bank_client_df.loc['client2':'client4':2, 'Client Name':'Net worth [$]']

        Client Name  Net worth [$]
client2       Steve           3000
client4      Morris           2000

In [138]:
bank_client_df.loc['client2':'client4':2, ['Client Name', 'Years with bank']]
# fancy indexing 사용해서 조회

        Client Name  Years with bank
client2       Steve                7
client4      Morris               15

In [145]:
bank_client_df

         Client ID Client Name  Net worth [$]  Years with bank
client1          1         Aly          35000                4
client2          2       Steve           3000                7
client3          3      Nicole         100000               10
client4          4      Morris           2000               15

In [147]:
bank_client_df.loc['client2']

Client ID              2
Client Name        Steve
Net worth [$]       3000
Years with bank        7
Name: client2, dtype: object

In [151]:
bank_client_df['Client Name']

client1       Aly
client2     Steve
client3    Nicole
client4    Morris
Name: Client Name, dtype: object

In [150]:
# 이름이 Steve인 고객 정보 출력
bank_client_df.loc[bank_client_df['Client Name'] == 'Steve'] # DataFrame **중요**
# print(bank_client_df.loc[bank_client_df['Client Name'] == 'Steve'], n)
# print(type(bank_client_df.loc[bank_client_df['Client Name'] == 'Steve']), n)

         Client ID Client Name  Net worth [$]  Years with bank
client2          2       Steve           3000                7

In [143]:
bank_client_df['Client Name']

client1       Aly
client2     Steve
client3    Nicole
client4    Morris
Name: Client Name, dtype: object

In [141]:
# Client Name 만 출력
bank_client_df.loc[:,'Client Name']

client1       Aly
client2     Steve
client3    Nicole
client4    Morris
Name: Client Name, dtype: object

In [142]:
# Client Name과 Net worth [$] 출력
bank_client_df.loc[:,['Client Name', 'Net worth [$]']]

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [153]:
# Client Name과 Net worth [$] 출력
bank_client_df[['Client Name', 'Net worth [$]']]

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [165]:
# filter 조회
# bank_client_df.filter(like='client')
bank_client_df.filter(items=['Client Name', 'Net worth [$]'])

        Client Name  Net worth [$]
client1         Aly          35000
client2       Steve           3000
client3      Nicole         100000
client4      Morris           2000

In [167]:
# fancy indexing 과 filter 조회 차이점

bank_client_df.filter(like='$', axis=0)

Empty DataFrame
Columns: [Client ID, Client Name, Net worth [$], Years with bank]
Index: []

In [168]:
# fancy indexing 과 filter 조회 차이점

bank_client_df.filter(like='$', axis=1)

         Net worth [$]
client1          35000
client2           3000
client3         100000
client4           2000

In [ ]:
# fancy indexing 과 filter 조회 차이점

bank_client_df.filter(like='4', axis=0)
# 'like' 인자에 정규표현식을 활용할 수 있습니다.
# 예를 들어, '3' 또는 '4'를 포함하는 인덱스를 필터링하려면 아래와 같이 사용합니다.

bank_client_df.filter(like='3', axis=0)  # '3'이 포함된 인덱스
bank_client_df.filter(like='4', axis=0)  # '4'가 포함된 인덱스

# 만약 '3' 또는 '4'를 모두 포함하고 싶다면, filter 대신 정규표현식과 boolean indexing을 활용하거나,
# filter의 'regex' 인자를 사용할 수 있습니다.

         Client ID Client Name  Net worth [$]  Years with bank
client4          4      Morris           2000               15

In [176]:
# 정규표현식 사용 예시:
bank_client_df.filter(regex='3|4', axis=0)

# 위 코드는 인덱스에 '3' 또는 '4'가 포함된 행을 모두 반환합니다.

         Client ID Client Name  Net worth [$]  Years with bank
client3          3      Nicole         100000               10
client4          4      Morris           2000               15

In [4]:
# 3. 2차원 ndarray 활용

---
##### 행 추가 및 삭제

In [185]:
students = [
    {'name': 'John', 'midterm': 95, 'final': 85},
    {'name': 'Jane', 'midterm': 85, 'final': 95},
    {'name': 'Jim', 'midterm': 90, 'final': 88},
    {'name': 'Jill', 'midterm': 88, 'final': 100}
]

df = pd.DataFrame(students)
df

   name  midterm  final
0  John       95     85
1  Jane       85     95
2   Jim       90     88
3  Jill       88    100

In [188]:
# 1. loc 이용
df.loc[3] = ['Jill-fix', 88, 100]
df.loc[len(df)] = ['Park', 82, 87] # len(df) : 행의 개수 : 4
df

       name  midterm  final
0      John       95     85
1      Jane       85     95
2       Jim       90     88
3  Jill-fix       88    100
4      Park       82     87
5      Park       82     87
6      Park       82     87

In [ ]:
students = [
    {'name': 'John', 'midterm': 95, 'final': 85},
    {'name': 'Jane', 'midterm': 85, 'final': 95},
    {'name': 'Jim', 'midterm': 90, 'final': 88},
    {'name': 'Jill', 'midterm': 88, 'final': 100}
]

df = pd.DataFrame(students)
df

   name  midterm  final
0  John       95     85
1  Jane       85     95
2   Jim       90     88
3  Jill       88    100

In [ ]:
# 2. pd.concat 이용
df = pd.concat([df, ['April', 82, 87]])
# cannot concatenate object of type '<class 'list'>'; only Series and DataFrame objs are valid

TypeError: cannot concatenate object of type '<class 'list'>'; only Series and DataFrame objs are valid

In [ ]:
# 2. pd.concat 이용
add_student_df = pd.DataFrame([['April', 82, 87]])
df = pd.concat([df, add_student_df])
df
# 병합을 하려고 concat 이용하면 오류 발생
# 우리가 준 add_student_df 는 컬럼 이름이 없는 상태

   name  midterm  final      0     1     2
0  John     95.0   85.0    NaN   NaN   NaN
1  Jane     85.0   95.0    NaN   NaN   NaN
2   Jim     90.0   88.0    NaN   NaN   NaN
3  Jill     88.0  100.0    NaN   NaN   NaN
0   NaN      NaN    NaN  April  82.0  87.0

In [200]:
students = [
    {'name': 'John', 'midterm': 95, 'final': 85},
    {'name': 'Jane', 'midterm': 85, 'final': 95},
    {'name': 'Jim', 'midterm': 90, 'final': 88},
    {'name': 'Jill', 'midterm': 88, 'final': 100}
]

df = pd.DataFrame(students)
df

   name  midterm  final
0  John       95     85
1  Jane       85     95
2   Jim       90     88
3  Jill       88    100

In [199]:
# 2. pd.concat 이용
add_student_df = pd.DataFrame([['April', 82, 87]], columns=['name', 'midterm', 'final'])
df = pd.concat([df, add_student_df])
df
# 직접 columns에 넣어주자.

    name  midterm  final
0   John       95     85
1   Jane       85     95
2    Jim       90     88
3   Jill       88    100
0  April       82     87
0  April       82     87

In [18]:
students = [
    {'name': 'John', 'midterm': 95, 'final': 85},
    {'name': 'Jane', 'midterm': 85, 'final': 95},
    {'name': 'Jim', 'midterm': 90, 'final': 88},
    {'name': 'Jill', 'midterm': 88, 'final': 100}
]

df = pd.DataFrame(students)
df

   name  midterm  final
0  John       95     85
1  Jane       85     95
2   Jim       90     88
3  Jill       88    100

In [19]:
# 2. pd.concat() 이용: DataFrame 병합합
add_student_df = pd.DataFrame([['April', 82, 87]])
df = pd.concat([df, add_student_df])
df
# ! -> 직접 columns에 넣어주자. 인덱스가 문제 생겼으므로 
# ! -> ignore_index=True 추가해서 인덱스를 새로 부여

   name  midterm  final      0     1     2
0  John     95.0   85.0    NaN   NaN   NaN
1  Jane     85.0   95.0    NaN   NaN   NaN
2   Jim     90.0   88.0    NaN   NaN   NaN
3  Jill     88.0  100.0    NaN   NaN   NaN
0   NaN      NaN    NaN  April  82.0  87.0

In [20]:
# 2. pd.concat() 이용: DataFrame 병합합
add_student_df = pd.DataFrame([['USA']])
df = pd.concat([df, add_student_df])
df
# ! -> 직접 columns에 넣어주자. 인덱스가 문제 생겼으므로 
# ! -> ignore_index=True 추가해서 인덱스를 새로 부여

   name  midterm  final      0     1     2
0  John     95.0   85.0    NaN   NaN   NaN
1  Jane     85.0   95.0    NaN   NaN   NaN
2   Jim     90.0   88.0    NaN   NaN   NaN
3  Jill     88.0  100.0    NaN   NaN   NaN
0   NaN      NaN    NaN  April  82.0  87.0
0   NaN      NaN    NaN    USA   NaN   NaN

In [21]:
# 2. pd.concat() 이용: DataFrame 병합합
add_student_df = pd.DataFrame([['April', 82, 87]])
df = pd.concat([df, add_student_df], ignore_index=True)
df
# ! -> 직접 columns에 넣어주자. 인덱스가 문제 생겼으므로 
# ! -> ignore_index=True 추가해서 인덱스를 새로 부여

   name  midterm  final      0     1     2
0  John     95.0   85.0    NaN   NaN   NaN
1  Jane     85.0   95.0    NaN   NaN   NaN
2   Jim     90.0   88.0    NaN   NaN   NaN
3  Jill     88.0  100.0    NaN   NaN   NaN
4   NaN      NaN    NaN  April  82.0  87.0
5   NaN      NaN    NaN    USA   NaN   NaN
6   NaN      NaN    NaN  April  82.0  87.0

In [24]:
# 2. pd.concat() 이용: DataFrame 병합합
add_student_df = pd.DataFrame([['April', 82, 87]], columns=['name', 'midterm', 'final'])
df = pd.concat([df, add_student_df], ignore_index=True).reset_index(drop=True)
df
# ! -> 직접 columns에 넣어주자. 인덱스가 문제 생겼으므로 
# ! -> ignore_index=True 추가해서 인덱스를 새로 부여

    name  midterm  final      0     1     2
0   John     95.0   85.0    NaN   NaN   NaN
1   Jane     85.0   95.0    NaN   NaN   NaN
2    Jim     90.0   88.0    NaN   NaN   NaN
3   Jill     88.0  100.0    NaN   NaN   NaN
4    NaN      NaN    NaN  April  82.0  87.0
5    NaN      NaN    NaN    USA   NaN   NaN
6    NaN      NaN    NaN  April  82.0  87.0
7  April     82.0   87.0    NaN   NaN   NaN
8  April     82.0   87.0    NaN   NaN   NaN

In [ ]:
# append를 사용해서 행을 추가할 수 있었으나, pandas 2.0부터는 append가 제거되었습니다.
# 따라서 append 대신 pd.concat을 사용하는 것이 권장됩니다.
df = df.append({'name': 'Park', 'midterm': 82, 'final': 87}, ignore_index=True)
df

AttributeError: 'DataFrame' object has no attribute 'append'

In [26]:
df

    name  midterm  final      0     1     2
0   John     95.0   85.0    NaN   NaN   NaN
1   Jane     85.0   95.0    NaN   NaN   NaN
2    Jim     90.0   88.0    NaN   NaN   NaN
3   Jill     88.0  100.0    NaN   NaN   NaN
4    NaN      NaN    NaN  April  82.0  87.0
5    NaN      NaN    NaN    USA   NaN   NaN
6    NaN      NaN    NaN  April  82.0  87.0
7  April     82.0   87.0    NaN   NaN   NaN
8  April     82.0   87.0    NaN   NaN   NaN

In [27]:
# 행 삭제
# index 이용
# df = df.drop(df.index[[0]])
df

# df.drop(df.index[[4]], inplace=True)
# index 4 - 6 지우기
# df.drop(df.index[[4:7]]) 이렇게는 안 되고,
# 슬라이싱으로는 df.drop(df.index[4:7]) 이렇게 사용해야 4,5,6번째 행이 삭제됩니다.
df.drop(df.index[4:7], inplace=True)

df

    name  midterm  final    0   1   2
0   John     95.0   85.0  NaN NaN NaN
1   Jane     85.0   95.0  NaN NaN NaN
2    Jim     90.0   88.0  NaN NaN NaN
3   Jill     88.0  100.0  NaN NaN NaN
7  April     82.0   87.0  NaN NaN NaN
8  April     82.0   87.0  NaN NaN NaN

In [28]:
# 행 삭제
# index 이용
df = df.drop(df.index[[5]]).reset_index(drop=True)
df

    name  midterm  final    0   1   2
0   John     95.0   85.0  NaN NaN NaN
1   Jane     85.0   95.0  NaN NaN NaN
2    Jim     90.0   88.0  NaN NaN NaN
3   Jill     88.0  100.0  NaN NaN NaN
4  April     82.0   87.0  NaN NaN NaN

---
### 컬럼 추가

In [29]:
df = pd.DataFrame({
    '이름' : ['민정', '도연', '진형', '흥재'],
    '위치' : ['독산', '신림', '군포', '광명'],
    '성별' : ['F', 'F', 'M', 'M']
}, index=['첫째', '둘째', '셋째', '넷째'])
df

    이름  위치 성별
첫째  민정  독산  F
둘째  도연  신림  F
셋째  진형  군포  M
넷째  흥재  광명  M

In [32]:
df

    이름  위치 성별       취미
첫째  민정  독산  F  인공지능 공부
둘째  도연  신림  F  인공지능 공부
셋째  진형  군포  M  인공지능 공부
넷째  흥재  광명  M  인공지능 공부

In [30]:
# 컬럼 추가 1. 기본값 이용
df['취미'] = '인공지능 공부' # 없는 컬럼을 넣어주면 해당 열의 모든 행은 '인공지능 공부' 값이 들어간다.
df

    이름  위치 성별       취미
첫째  민정  독산  F  인공지능 공부
둘째  도연  신림  F  인공지능 공부
셋째  진형  군포  M  인공지능 공부
넷째  흥재  광명  M  인공지능 공부

In [ ]:
# 컬럼 추가 2. np.where() -> ndarray 이용
np.where(df['성별'] == 'M') # 조건에 맞는 인덱스 반환
# np.where()는 넘파이 함수이지만, 판다스의 Series(또는 DataFrame)에 적용할 수 있습니다.
# 그 이유는 판다스의 Series와 DataFrame이 내부적으로 넘파이의 ndarray를 기반으로 만들어졌기 때문입니다.
# 즉, df['성별'] == 'M'과 같은 조건문을 사용하면, 결과는 불리언 타입의 Series가 되는데,
# np.where()는 이 Series를 넘파이 배열처럼 처리하여 조건에 맞는 값을 반환합니다.
# 반환값은 넘파이 ndarray이므로, 이를 다시 DataFrame의 새로운 컬럼에 할당할 수 있습니다.

(array([2, 3]),)

In [256]:
# 컬럼 추가 2. np.where() -> ndarray 이용용
np.where(df['성별'] == 'M') # 조건에 맞는 인덱스 반환
np.where(df['성별'] == 'M', '남자', '여자') # 조건에 맞는 값 반환
# df['성별'] = np.where(df['성별'] == 'M', '남자', '여자') # 조건에 맞는 값 반환
df

    이름  위치 성별       취미
첫째  민정  독산  F  인공지능 공부
둘째  도연  신림  F  인공지능 공부
셋째  진형  군포  M  인공지능 공부
넷째  흥재  광명  M  인공지능 공부

In [257]:
# 컬럼 추가 2. np.where() -> ndarray 이용용
np.where(df['성별'] == 'M') # 조건에 맞는 인덱스 반환
np.where(df['성별'] == 'M', '남자', '여자') # 조건에 맞는 값 반환
df['성별(한글)'] = np.where(df['성별'] == 'M', '남자', '여자') # 조건에 맞는 값 반환
df

    이름  위치 성별       취미 성별(한글)
첫째  민정  독산  F  인공지능 공부     여자
둘째  도연  신림  F  인공지능 공부     여자
셋째  진형  군포  M  인공지능 공부     남자
넷째  흥재  광명  M  인공지능 공부     남자

In [258]:
df = pd.DataFrame({
    '이름' : ['민정', '도연', '진형', '흥재'],
    '위치' : ['독산', '신림', '군포', '광명'],
    '성별' : ['F', 'F', 'M', 'M'],
    '키' : [160, 165, 170, 175],
    '몸무게' : [50, 55, 60, 65]
}, index=['첫째', '둘째', '셋째', '넷째'])
df

    이름  위치 성별    키  몸무게
첫째  민정  독산  F  160   50
둘째  도연  신림  F  165   55
셋째  진형  군포  M  170   60
넷째  흥재  광명  M  175   65

In [ ]:
# 컬럼 추가 3. 기존 컬럼 연산 이용 -> Series 이용
# BMI = kg / m^2
df['BMI'] = df['몸무게'] / (df['키'] * 0.01) ** 2
df

    이름  위치 성별    키  몸무게        BMI
첫째  민정  독산  F  160   50  19.531250
둘째  도연  신림  F  165   55  20.202020
셋째  진형  군포  M  170   60  20.761246
넷째  흥재  광명  M  175   65  21.224490

In [261]:
# apply()
def get_type(value):
    return '저체중' if value < 20 else '정상' if value < 21 else '과체중' if value < 30 else '비만'
df['BMI'].apply(get_type)

첫째    저체중
둘째     정상
셋째     정상
넷째    과체중
Name: BMI, dtype: object

In [262]:
df

    이름  위치 성별    키  몸무게        BMI
첫째  민정  독산  F  160   50  19.531250
둘째  도연  신림  F  165   55  20.202020
셋째  진형  군포  M  170   60  20.761246
넷째  흥재  광명  M  175   65  21.224490

In [267]:
df['BMI type'] = df['BMI'].apply(get_type)
df

# apply() : 고차 함수 / get_type: 콜백 함수

    이름  위치 성별    키  몸무게        BMI BMI type
첫째  민정  독산  F  160   50  19.531250      저체중
둘째  도연  신림  F  165   55  20.202020       정상
셋째  진형  군포  M  170   60  20.761246       정상
넷째  흥재  광명  M  175   65  21.224490      과체중

In [ ]:
# 컬럼 삭제제 3. drop 이용
df.drop('BMI type', axis=1) # 컬럼 삭제, 그러나 원본 데이터는 변경되지 않음
df

    이름  위치 성별    키  몸무게        BMI
첫째  민정  독산  F  160   50  19.531250
둘째  도연  신림  F  165   55  20.202020
셋째  진형  군포  M  170   60  20.761246
넷째  흥재  광명  M  175   65  21.224490

In [265]:
df.drop('BMI type', axis=1, inplace=True) # 컬럼 삭제, 원본 데이터 변경
df

    이름  위치 성별    키  몸무게        BMI
첫째  민정  독산  F  160   50  19.531250
둘째  도연  신림  F  165   55  20.202020
셋째  진형  군포  M  170   60  20.761246
넷째  흥재  광명  M  175   65  21.224490

---
##### 정렬

In [273]:
bank_client_df = pd.read_csv('./data/bank_client_information.csv')
bank_client_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13

In [277]:
bank_client_df.sort_values(by='Net Worth', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [279]:
# 오래된 고객순으로 출력
bank_client_df.sort_values(by='Years with Bank', ascending=False)

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [ ]:
# 순자산이 많고 오래된 고개순으로 출력
# ! 정렬 기준으로 n개의 컬럼을 사용할 수 있으며, 이때 ascending 속성 역시 짝을 맞추어 n개 전달

# bank_client_df.sort_values(by=['Net Worth', 'Years with Bank'], ascending=False)
bank_client_df.sort_values(by=['Net Worth', 'Years with Bank'], ascending=[False, False])

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [ ]:
# '순자산이 많고 최신 고객순'으로 정렬하려면, 'Net Worth'는 내림차순(많은 순), 'Years with Bank'는 오름차순(가입 연차가 적은 순, 즉 최신 고객)으로 정렬해야 합니다.
# 즉, 아래와 같이 구성하면 됩니다. -> 두 조건이 맞지 않음.
bank_client_df.sort_values(by=['Net Worth', 'Years with Bank'], ascending=[False, True])
bank_client_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1

In [290]:
# rank() -> 순자산이 많은 순으로 순위 부여
bank_client_df['Net Worth'].rank(method='min')

5    10.0
6     9.0
7     8.0
3     7.0
1     6.0
2     5.0
9     4.0
4     2.0
0     2.0
8     1.0
Name: Net Worth, dtype: float64

In [303]:
bank_client_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Rank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,1
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,2
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,4
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,5
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,6
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,7
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,8
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,8
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,10

In [302]:
# rank() -> 순자산이 많은 순으로 순위 부여
bank_client_df['Rank'] = bank_client_df['Net Worth'].rank(ascending=False).astype(int)
# drop() 메서드는 기본적으로 원본 DataFrame을 변경하지 않고, 변경된 결과를 반환합니다.
# inplace=True 옵션을 사용하거나, 반환값을 변수에 다시 할당해야 컬럼이 실제로 삭제됩니다.

# 방법 1: inplace=True 사용
bank_client_df.drop(['Net Worth Rank'], axis=1, inplace=True)

# 방법 2: 반환값을 다시 할당
# bank_client_df = bank_client_df.drop(['Net Worth Rank'], axis=1)
bank_client_df

,First Name,Last Name,Email,Postal Code,Net Worth,Years with Bank,Rank
5,Samer,Mo,samer@gmail.com,J7H 3HY,100000.00,26,1
6,Heba,Ismail,heba.ismail@hotmail.com,K8Y 3M8,50000.00,11,2
7,Laila,Ahmed,Laila.a@hotmail.com,J8Y 3M0,20000.00,3,3
3,Chanel,Steve,chanel@gmail.com,N7T 3E6,11072.02,10,4
1,Noah,Small,nsmall@hotmail.com,N8S 14K,10000.00,6,5
2,Nina,Keller,azikez@gahew.mr,S1T 4E6,9072.02,7,6
9,Noah,Moran,guutodi@bigwoc.kw,K2D 4M9,8626.96,13,7
4,Kate,Noor,kate@hotmail.com,K8N 5H6,5000.00,22,8
0,Bird,Steve,bird@gmail.com,N94 3M0,5000.00,5,8
8,Joseph,Patton,daafeja@boh.jm,M6U 5U7,2629.13,1,10

### DataFrame Load & Save

In [ ]:
import numpy as np